import requests

url = "http://127.0.0.1:8000/predict"
data = {"comments": [
    "Супер поездка! 😍👍",                       # positive
    "Ужасно всё, больше не поеду 😡",           # negative
    "Ну такое себе, нормально 🤷‍♂️",           # neutral
    "Экипаж просто молодцы!!! 👏👏",             # positive
    "Сервис плохой, не понравилось 👎",         # negative
    "Ничего особенного, катались просто 😐",    # neutral
    "Вода чистая, красота 😍💦",                 # positive
    "Запах в каюте ужасный 🤢",                  # negative
    "Норм, но ожидал большего 😏",              # neutral
    "Все супер, детям понравилось! 😊",         # positive
    "Опоздание на рейс… 😤",                     # negative
    "Проехали без проблем, но скучно 😴",       # neutral
    "Прекрасный вид на реку 🌅",                 # positive
    "Постоянные поломки, раздражает 😠",         # negative
    "Поехали просто так, нормально ✌️"          # neutral
]}

resp = requests.post(url, json=data)

if resp.status_code == 200:
    print(resp.json())
else:
    print(f"Ошибка {resp.status_code}: {resp.text}")
